tap "blendle/blendle"
tap "buo/cask-upgrade"
tap "dahlia/jetbrains-eap"
tap "derailed/k9s"
tap "eddieantonio/eddieantonio"
tap "heroku/brew"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "rconroy293/seventeenlands"
tap "tomazwang/thirsty-tap", "https://github.com/TomazWang/homebrew-thirsty-tap.git"
tap "xcodesorg/made"
brew "ack"
brew "harfbuzz"
brew "apktool"
brew "apr-util"
brew "aria2"
brew "bat"
brew "ccat"
brew "certifi"
brew "chezmoi"
brew "cmake"
brew "cocoapods"
brew "curl"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "unbound"
brew "gnutls"
brew "libass"
brew "srt"
brew "ffmpeg"
brew "fnm"
brew "freetds"
brew "fswatch"
brew "fzf"
brew "genact"
brew "gh"
brew "git"
brew "gobject-introspection"
brew "gradle"
brew "howdoi"
brew "jq"
brew "jump"
brew "kdoctor"
brew "kube-ps1"
brew "kubectx"
brew "lazygit"
brew "m-cli"
brew "mas"
brew "minikube"
brew "navi"
brew "php"
brew "pidcat"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "rust"
brew "scrcpy"
brew "shellcheck"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "trash-cli", link: true
brew "watchman"
brew "wget"
brew "yank"
brew "yq"
brew "zsh"
brew "blendle/blendle/kns"
brew "derailed/k9s/k9s"
brew "eddieantonio/eddieantonio/imgcat"
brew "heroku/brew/heroku"
brew "mongodb/brew/mongodb-database-tools"
brew "oven-sh/bun/bun"
brew "xcodesorg/made/xcodes"
cask "1password@beta"
cask "alfred"
cask "android-studio"
cask "android-studio-preview@canary"
cask "audacity"
cask "bartender"
cask "chatgpt"
cask "cleanshot"
cask "contexts"
cask "cursor"
cask "discord"
cask "disk-drill"
cask "docker-desktop"
cask "dropbox"
cask "evernote"
cask "fig"
cask "font-fira-code"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-chrome@canary"
cask "google-drive"
cask "hiddenbar"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "itsycal"
cask "jetbrains-toolbox"
cask "joplin"
cask "jordanbaird-ice"
cask "keycastr"
cask "logseq"
cask "macmediakeyforwarder"
cask "microsoft-edge"
cask "notion"
cask "obsidian"
cask "postman"
cask "raycast"
cask "shottr"
cask "slack"
cask "spotify"
cask "spotmenu"
cask "steam"
cask "surfshark"
cask "synology-drive"
cask "tableplus"
cask "telegram"
cask "ticktick"
cask "todoist-app"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zen"
mas "1Password for Safari", id: 1569813296
mas "DaVinci Resolve", id: 571213070
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "Horo", id: 1437226581
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Trello", id: 1278508951
mas "Velja", id: 1607635845
mas "Yoink", id: 457622435
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bceskavich.theme-dracula-at-night"
vscode "benjaminbenais.copilot-theme"
vscode "benjaminblonde.monokai-alt"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "brittanychiang.halcyon-vscode"
vscode "castwide.solargraph"
vscode "danlevett.pattern-links"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dbankier.vscode-instant-markdown"
vscode "docsmsft.docs-yaml"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "infeng.vscode-react-typescript"
vscode "ivory-lab.jenkinsfile-support"
vscode "jakearl.search-editor-apply-changes"
vscode "k--kato.intellij-idea-keybindings"
vscode "kumar-harsh.graphql-for-vscode"
vscode "marlon407.code-groovy"
vscode "maximus136.change-string-case"
vscode "mechatroner.rainbow-csv"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "nickdemayo.vscode-json-editor"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "nonoroazoro.syncing"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "pkief.material-icon-theme"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rioukkevin.vscode-git-commit"
vscode "shardulm94.trailing-spaces"
vscode "specstory.specstory-vscode"
vscode "spywhere.guides"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "tomoki1207.pdf"
vscode "tomsaunders.vscode-workspace-explorer"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "visualstudioexptteam.vscodeintellicode-insiders"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wingrunr21.vscode-ruby"
vscode "withfig.fig"
vscode "xyc.vscode-mdx-preview"
vscode "yechunan.json-color-token"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
